For sure. With some minor changes - Here we go:

```hcl
provider "aws" {
  max_retries = 1337
  region      = "eu-central-1"
  profile     = "devops"
}

data "aws_route53_zone" "zone" {
  name         = "test.dev.reservix.cloud."
  private_zone = false
}

locals {
  domain                    = "${substr(data.aws_route53_zone.zone.name, 0, length(data.aws_route53_zone.zone.name) - 1)}"
  subdomains                = ["one", "two", "three", "four", "fife", "six", "seven", "eight", "nine"]
  subject_alternative_names = "${flatten(formatlist("%s.%s", local.subdomains, local.domain))}"
}

resource "aws_acm_certificate" "cert" {
  domain_name               = "${data.aws_route53_zone.zone.name}"
  subject_alternative_names = "${local.subject_alternative_names}"
  validation_method         = "DNS"
}

resource "aws_route53_record" "cert_validation" {
  count = "${length(aws_acm_certificate.cert.domain_validation_options)}"

  name    = "${lookup(aws_acm_certificate.cert.domain_validation_options[count.index], "resource_record_name")}"
  type    = "${lookup(aws_acm_certificate.cert.domain_validation_options[count.index], "resource_record_type")}"
  records = "${lookup(aws_acm_certificate.cert.domain_validation_options[count.index], "resource_record_value")}"
  zone_id = "${data.aws_route53_zone.zone.id}"
  ttl     = 60
}

resource "aws_acm_certificate_validation" "cert" {
  certificate_arn         = "${aws_acm_certificate.cert.arn}"
  validation_record_fqdns = "${aws_route53_record.cert_validation[*].fqdn}"
}
```

```console
$ tf apply

Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)

data.aws_route53_zone.zone: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "test.dev.reservix.cloud"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "eight.test.dev.reservix.cloud",
          + "fife.test.dev.reservix.cloud",
          + "four.test.dev.reservix.cloud",
          + "nine.test.dev.reservix.cloud",
          + "one.test.dev.reservix.cloud",
          + "seven.test.dev.reservix.cloud",
          + "six.test.dev.reservix.cloud",
          + "three.test.dev.reservix.cloud",
          + "two.test.dev.reservix.cloud",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.cert_validation[0] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[1] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[2] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[3] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[4] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[5] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[6] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[7] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[8] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation[9] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

Plan: 12 to add, 0 to change, 0 to destroy.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_acm_certificate.cert: Creating...
aws_acm_certificate.cert: Still creating... [10s elapsed]
aws_acm_certificate.cert: Creation complete after 19s [id=arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4]
aws_route53_record.cert_validation[4]: Creating...
aws_route53_record.cert_validation[5]: Creating...
aws_route53_record.cert_validation[8]: Creating...
aws_route53_record.cert_validation[6]: Creating...
aws_route53_record.cert_validation[9]: Creating...
aws_route53_record.cert_validation[1]: Creating...
aws_route53_record.cert_validation[7]: Creating...
aws_route53_record.cert_validation[3]: Creating...
aws_route53_record.cert_validation[0]: Creating...
aws_route53_record.cert_validation[2]: Creating...
aws_route53_record.cert_validation[5]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[8]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[6]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[4]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[9]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[7]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[3]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[1]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[0]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[2]: Still creating... [10s elapsed]
aws_route53_record.cert_validation[5]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[8]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[6]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[4]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[9]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[7]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[3]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[1]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[0]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[2]: Still creating... [20s elapsed]
aws_route53_record.cert_validation[5]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[8]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[6]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[4]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[9]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[1]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[7]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[3]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[0]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[2]: Still creating... [30s elapsed]
aws_route53_record.cert_validation[0]: Creation complete after 33s [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[6]: Creation complete after 33s [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[7]: Creation complete after 33s [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[5]: Creation complete after 33s [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[3]: Creation complete after 33s [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[4]: Creation complete after 34s [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[9]: Creation complete after 34s [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[8]: Creation complete after 34s [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[1]: Creation complete after 35s [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[2]: Still creating... [40s elapsed]
aws_route53_record.cert_validation[2]: Creation complete after 41s [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_acm_certificate_validation.cert: Creating...
aws_acm_certificate_validation.cert: Still creating... [10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [40s elapsed]
aws_acm_certificate_validation.cert: Still creating... [50s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m0s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m40s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m50s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m0s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m30s elapsed]
aws_acm_certificate_validation.cert: Creation complete after 2m33s [id=2019-12-15 20:11:57 +0000 UTC]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
$ tf apply

Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)

data.aws_route53_zone.zone: Refreshing state...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4]
aws_route53_record.cert_validation[8]: Refreshing state... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[4]: Refreshing state... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[2]: Refreshing state... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[3]: Refreshing state... [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[1]: Refreshing state... [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[5]: Refreshing state... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[6]: Refreshing state... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[0]: Refreshing state... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[7]: Refreshing state... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[9]: Refreshing state... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_acm_certificate_validation.cert: Refreshing state... [id=2019-12-15 20:11:57 +0000 UTC]

Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)


Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
$ tf destroy

Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)

data.aws_route53_zone.zone: Refreshing state...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4]
aws_route53_record.cert_validation[2]: Refreshing state... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[5]: Refreshing state... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[1]: Refreshing state... [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[4]: Refreshing state... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[0]: Refreshing state... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[7]: Refreshing state... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[8]: Refreshing state... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[9]: Refreshing state... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[3]: Refreshing state... [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[6]: Refreshing state... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_acm_certificate_validation.cert: Refreshing state... [id=2019-12-15 20:11:57 +0000 UTC]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be destroyed
  - resource "aws_acm_certificate" "cert" {
      - arn                       = "arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4" -> null
      - domain_name               = "test.dev.reservix.cloud" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "test.dev.reservix.cloud"
              - resource_record_name  = "_5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_eeccaa8d5151bfd6357930ad538b0b28.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "four.test.dev.reservix.cloud"
              - resource_record_name  = "_5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c73a6232e9d56e0ab5df70eb480fbf12.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "six.test.dev.reservix.cloud"
              - resource_record_name  = "_189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_f1ad70f2f2d5723b89e3ef8c853a7ba4.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "eight.test.dev.reservix.cloud"
              - resource_record_name  = "_38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_abbd0d5a6d7e4279c69401c09b65b50e.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "nine.test.dev.reservix.cloud"
              - resource_record_name  = "_d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_29f21634897e69eb0d5fdcf8270f6a0c.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "seven.test.dev.reservix.cloud"
              - resource_record_name  = "_a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_fdd1bb8eac7cca3db127c4ba313418df.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "one.test.dev.reservix.cloud"
              - resource_record_name  = "_ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6cdfde15f0ed0a234cb4f5691ce1d5a8.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "two.test.dev.reservix.cloud"
              - resource_record_name  = "_bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_95e3ff8ba342f8d95916c0fbf5a7f426.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "three.test.dev.reservix.cloud"
              - resource_record_name  = "_3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9e05a42d23907dd06acfc39c33474579.mzlfeqexyx.acm-validations.aws."
            },
          - {
              - domain_name           = "fife.test.dev.reservix.cloud"
              - resource_record_name  = "_95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_482d1920318797f2c3e4b7c5dd929198.mzlfeqexyx.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4" -> null
      - subject_alternative_names = [
          - "eight.test.dev.reservix.cloud",
          - "fife.test.dev.reservix.cloud",
          - "four.test.dev.reservix.cloud",
          - "nine.test.dev.reservix.cloud",
          - "one.test.dev.reservix.cloud",
          - "seven.test.dev.reservix.cloud",
          - "six.test.dev.reservix.cloud",
          - "three.test.dev.reservix.cloud",
          - "two.test.dev.reservix.cloud",
        ] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.cert will be destroyed
  - resource "aws_acm_certificate_validation" "cert" {
      - certificate_arn         = "arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4" -> null
      - id                      = "2019-12-15 20:11:57 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud",
          - "_38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud",
          - "_3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud",
          - "_5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud",
          - "_5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud",
          - "_95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud",
          - "_a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud",
          - "_bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud",
          - "_d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud",
          - "_ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud",
        ] -> null
    }

  # aws_route53_record.cert_validation[0] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud" -> null
      - records = [
          - "_eeccaa8d5151bfd6357930ad538b0b28.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[1] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud" -> null
      - records = [
          - "_c73a6232e9d56e0ab5df70eb480fbf12.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[2] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud" -> null
      - records = [
          - "_f1ad70f2f2d5723b89e3ef8c853a7ba4.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[3] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud" -> null
      - records = [
          - "_abbd0d5a6d7e4279c69401c09b65b50e.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[4] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud" -> null
      - records = [
          - "_29f21634897e69eb0d5fdcf8270f6a0c.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[5] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud" -> null
      - records = [
          - "_fdd1bb8eac7cca3db127c4ba313418df.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[6] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud" -> null
      - records = [
          - "_6cdfde15f0ed0a234cb4f5691ce1d5a8.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[7] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud" -> null
      - records = [
          - "_95e3ff8ba342f8d95916c0fbf5a7f426.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[8] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud" -> null
      - records = [
          - "_9e05a42d23907dd06acfc39c33474579.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

  # aws_route53_record.cert_validation[9] will be destroyed
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud" -> null
      - id      = "Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME" -> null
      - name    = "_95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud" -> null
      - records = [
          - "_482d1920318797f2c3e4b7c5dd929198.mzlfeqexyx.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z28B3YX20SREXV" -> null
    }

Plan: 0 to add, 0 to change, 12 to destroy.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 19, in resource "aws_acm_certificate" "cert":
  19:   domain_name               = "${data.aws_route53_zone.zone.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on test.tf line 20, in resource "aws_acm_certificate" "cert":
  20:   subject_alternative_names = "${local.subject_alternative_names}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 6 more similar warnings elsewhere)

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

aws_acm_certificate_validation.cert: Destroying... [id=2019-12-15 20:11:57 +0000 UTC]
aws_acm_certificate_validation.cert: Destruction complete after 0s
aws_route53_record.cert_validation[3]: Destroying... [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[4]: Destroying... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[8]: Destroying... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[6]: Destroying... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[0]: Destroying... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[9]: Destroying... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[1]: Destroying... [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[7]: Destroying... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[2]: Destroying... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[5]: Destroying... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation[3]: Still destroying... [id=Z28B3YX20SREXV__38cf8495690716eece0b963...5.eight.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[4]: Still destroying... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df...14.nine.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[6]: Still destroying... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f...a42.one.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[8]: Still destroying... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcf...f.three.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[0]: Still destroying... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[9]: Still destroying... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e...92.fife.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[1]: Still destroying... [id=Z28B3YX20SREXV__5c90a857aeb3c4900572544...9b.four.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[7]: Still destroying... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e386...246.two.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[5]: Still destroying... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59...1.seven.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[2]: Still destroying... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc7...9b7.six.test.dev.reservix.cloud._CNAME, 10s elapsed]
aws_route53_record.cert_validation[3]: Still destroying... [id=Z28B3YX20SREXV__38cf8495690716eece0b963...5.eight.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[4]: Still destroying... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df...14.nine.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[6]: Still destroying... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f...a42.one.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[8]: Still destroying... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcf...f.three.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[0]: Still destroying... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[9]: Still destroying... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e...92.fife.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[1]: Still destroying... [id=Z28B3YX20SREXV__5c90a857aeb3c4900572544...9b.four.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[7]: Still destroying... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e386...246.two.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[5]: Still destroying... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59...1.seven.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[2]: Still destroying... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc7...9b7.six.test.dev.reservix.cloud._CNAME, 20s elapsed]
aws_route53_record.cert_validation[4]: Still destroying... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df...14.nine.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[3]: Still destroying... [id=Z28B3YX20SREXV__38cf8495690716eece0b963...5.eight.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[6]: Still destroying... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f...a42.one.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[8]: Still destroying... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcf...f.three.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[0]: Still destroying... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[9]: Still destroying... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e...92.fife.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[1]: Still destroying... [id=Z28B3YX20SREXV__5c90a857aeb3c4900572544...9b.four.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[7]: Still destroying... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e386...246.two.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[5]: Still destroying... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59...1.seven.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[2]: Still destroying... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc7...9b7.six.test.dev.reservix.cloud._CNAME, 30s elapsed]
aws_route53_record.cert_validation[2]: Destruction complete after 34s
aws_route53_record.cert_validation[0]: Destruction complete after 37s
aws_route53_record.cert_validation[9]: Destruction complete after 38s
aws_route53_record.cert_validation[1]: Destruction complete after 38s
aws_route53_record.cert_validation[7]: Destruction complete after 38s
aws_route53_record.cert_validation[8]: Destruction complete after 38s
aws_route53_record.cert_validation[4]: Destruction complete after 38s
aws_route53_record.cert_validation[5]: Destruction complete after 38s
aws_route53_record.cert_validation[6]: Destruction complete after 38s
aws_route53_record.cert_validation[3]: Destruction complete after 39s
aws_acm_certificate.cert: Destroying... [id=arn:aws:acm:eu-central-1:159388291991:certificate/df21c899-13b4-42d0-9dce-58815d472ee4]
aws_acm_certificate.cert: Destruction complete after 0s

Destroy complete! Resources: 12 destroyed.
```